Revit 2024 API
StairsPathType.StartFromRiser Property
 True if the stairs path starts from the riser, false if it starts from the tread.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool StartFromRiser { get; set; }
Visual Basic
Public Property StartFromRiser As Boolean
	Get
	Set
Visual C++
public:
property bool StartFromRiser {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The StairsPathType is not fixed up direction so the data being set is not applicable.
See Also
StairsPathType Class
Autodesk.Revit.DB.Architecture Namespace